dataframe 연산

연산 수행 메서드활용: nan 값 설정 -> 연산 수행 가능

In [1]:
#모듈 로딩
import pandas as pd
import numpy as np          # for. 빈칸 표현

In [2]:
#데이터 준비
data={'A':[98,78,np.nan,52],'B':[90,70,10,50]}

In [5]:
#dict -> df
df1=pd.DataFrame(data)
df1

      A   B
0  98.0  90
1  78.0  70
2   NaN  10
3  52.0  50

In [6]:
#연산 수행
df1.add(5,fill_value=0)

       A   B
0  103.0  95
1   83.0  75
2    5.0  15
3   57.0  55

In [12]:
#df+df
df1.add(df1+10,fill_value=0)

       A    B
0  206.0  190
1  166.0  150
2    NaN   30
3  114.0  110

In [13]:
df1.add(df1+10,axis=1)

       A    B
0  206.0  190
1  166.0  150
2    NaN   30
3  114.0  110

In [14]:
data2={'A':[98,78,20,52],'B':[90,70,10,50]}
df2=pd.DataFrame(data2)
df2

    A   B
0  98  90
1  78  70
2  20  10
3  52  50

In [15]:
df1.add(df2,fill_value=0)

       A    B
0  196.0  180
1  156.0  140
2   20.0   20
3  104.0  100